{
  "English": "Ingliz tili",
  "Russian": "Rus tili",
  "Uzbek": "O'zbek tili",
  "Mail Us!": "Bizga yozing!",
  "Call Us!": "Bizga qo'ng'iroq qiling!",
  "Home": "Bosh sahifa",
  "Projects": "Loyihalar",
  "Pricing": "Narxlar",
  "Market analysis": "Bozor tahlili",
  "Our Projects": "Bizning Loyihalarimiz",
  "Location": "Location",
  "A reasonable guide to success:": "Muvaffaqiyat uchun oqilona qo'llanma:",
  "Optimize your business with us!": "Biz bilan biznesingizni optimallashtiring!",
  "Grow your business with us!": "Biz bilan biznesingizni rivojlantiring!",
  "Set up efficiency with us!": "Biz bilan samaradorlikni sozlang!",
  "Business Consulting:": "Biznes konsalting:",
  "Business Management:": "Biznesni boshqarish:",
  "Growth strategies:": "O'sish strategiyalari:",
  "Your success is in safe hands!": "Sizning muvaffaqiyatingiz ishonchli qo'llarda!",
  "Partnership with major global corporations": "Yirik global korporatsiyalar bilan hamkorlik",
  "Many successful projects": "Ko'plab muvaffaqiyatli loyihalar",
  "International recognition": "Xalqaro e'tirof",
  "Expanding the geographical presence": "Geografik mavjudligini kengaytirish",
  "Welcome to DKSP PLUS": "DKSP PLUS-ga xush kelibsiz",
  "Creating Your Future together": "Birgalikda kelajagingizni yarating",
  "Years of experience": "Tajriba yillari",
  "We specialize in helping your business reach new heights and successfully overcome the challenges of the modern market. Our team of experts is ready to offer you innovative strategies and solutions that will help your company achieve sustainable growth and prosperity. Trust us, and together we will create your bright and successful future!": "Biz sizning biznesingizga yangi cho'qqilarni zabt etishda va zamonaviy bozor qiyinchiliklarini muvaffaqiyatli engishda yordam berishga ixtisoslashganmiz. Bizning mutaxassislar jamoasi sizning korxonangizga barqaror o'sish va farovonlikka erishishga yordam beradigan innovatsion strategiya va echimlarni taklif qilishga tayyor. Bizga ishoning va biz birgalikda sizning yorqin va muvaffaqiyatli kelajagingizni yaratamiz!",
  "Years of success": "Muvaffaqiyat yillari",
  "Years of work": "Ish yillari",
  "Strategic Development Consulting": "Strategik rivojlanish bo'yicha maslahat",
  "We develop and implement strategies aimed at sustainable growth and competitiveness of your business": "WBiz sizning biznesingizning barqaror o'sishi va raqobatbardoshligiga qaratilgan strategiyalarni ishlab chiqamiz va amalga oshiramiz",
  "Project management": "Loyihani boshqarish",
  "We offer professional management of your projects, ensuring their successful completion within budget and deadlines": "Biz sizning loyihalaringizni byudjet va muddatlarda muvaffaqiyatli bajarilishini ta'minlash orqali professional boshqarishni taklif qilamiz",
  "Business analysis and process optimization": "Biznesni tahlil qilish va jarayonlarni optimallashtirish",
  "Our team will analyze your business, identify bottlenecks and offer optimal solutions to increase efficiency and productivity": "Bizning jamoamiz sizning biznesingizni tahlil qiladi, to'siqlarni aniqlaydi va samaradorlik va samaradorlikni oshirish uchun maqbul echimlarni taklif qiladi",
  "Development of business strategies and models": "Biznes strategiyalari va modellarini ishlab chiqish",
  "We will help you create and implement innovative business strategies and models that match your goals and ambitions": "Biz sizga maqsad va ambitsiyalaringizga mos keladigan innovatsion biznes strategiyalari va modellarini yaratish va amalga oshirishda yordam beramiz",
  "Financial planning and analysis": "Moliyaviy rejalashtirish va tahlil qilish",
  "Technological consulting": "Texnologik maslahat",
  "Our experts will provide advice on the implementation and use of advanced technologies to optimize your business": "Bizning mutaxassislarimiz biznesingizni optimallashtirish uchun ilg'or texnologiyalarni joriy etish va ulardan foydalanish bo'yicha maslahatlar beradi",
  "We will help you develop financial strategies, analyze investments and make the right financial decisions for your business": "Biz sizga moliyaviy strategiyalarni ishlab chiqishda, investitsiyalarni tahlil qilishda va biznesingiz uchun to'g'ri moliyaviy qarorlar qabul qilishda yordam beramiz",
  "Our services": "Bizning xizmatlarimiz",
  "We offer a variety of services focused on achieving your business goals. We specialize in consulting, strategic planning, project management, business model development and much more": "Biz sizning biznes maqsadlaringizga erishishga qaratilgan turli xil xizmatlarni taklif etamiz. Biz konsalting, strategik rejalashtirish, loyihalarni boshqarish, biznes modellarini ishlab chiqish va boshqalarga ixtisoslashganmiz",
  "Projects completed": "Loyihalar bajarildi",
  "Employees": "Xodimlar",
  "Business partners": "Biznes sheriklari",
  "Satisfied customers": "Mamnun mijozlar",
  "Professionalism and trust": "Professionallik va ishonch",
  "We build long-term relationships with our clients based on professionalism, trust and transparency. Your success is our priority": "Biz mijozlarimiz bilan professionallik, ishonch va shaffoflik asosida uzoq muddatli munosabatlarni o'rnatamiz. Sizning muvaffaqiyatingiz bizning ustuvorligimizdir",
  "Individual approach": "Shaxsiy yondashuv",
  "We approach each client in a unique way, understanding their unique needs, goals and challenges": "Biz har bir mijozga ularning noyob ehtiyojlari, maqsadlari va qiyinchiliklarini tushunib, o'ziga xos tarzda yondashamiz",
  "In-depth analysis and expertise": "Chuqur tahlil va ekspertiza",
  "We base our recommendations and strategies on an extensive analysis of the market, trends and your current situation": "Biz o'z tavsiyalarimiz va strategiyalarimizni bozorni, tendentsiyalarni va hozirgi holatingizni keng tahlil qilishga asoslaymiz",
  "Why us specifically": "Nima uchun biz",
  "Why our company is the best choice for consulting": "Nima uchun bizning kompaniyamiz konsalting uchun eng yaxshi tanlovdir",
  "By choosing us, you choose a partner who is ready to help you overcome business challenges and reach new heights. Entrust your strategic development to us, and we will make your success our priority": "Bizni tanlab, siz biznes qiyinchiliklarini engishga va yangi marralarni zabt etishga yordam beradigan sherikni tanlaysiz. Strategik rivojlanishingizni bizga ishoning va biz sizning muvaffaqiyatingizni ustuvor vazifaga aylantiramiz",
  "Write to us": "Bizga yozing",
  "The form of the record": "Yozuv shakli",
  "Your name": "Sizning ismingiz",
  "Telephone": "Telefon",
  "Date": "Sana",
  "Confirm": "Tasdiqlash",
  "Any other questions?": "Savollar qoldimi?",
  "Customer Satisfaction": "Mijozlarni qondirish",
  "If you have any questions or need help, please contact our team or call us:": "Agar sizda biron bir savol bo'lsa yoki yordamga muhtoj bo'lsangiz, jamoamiz bilan bog'laning yoki qo'ng'iroq qiling:",
  "Customers": "Mijozlar",
  "Our reliable customers!": "Bizning ishonchli mijozlarimiz!",
  "Please refer to our contact information and learn more about our consulting services. We strive to be your reliable partner in implementing business projects and achieving your goals": "Bizning aloqa ma'lumotlarimizga murojaat qiling va konsalting xizmatlarimiz haqida ko'proq bilib oling. Biz biznes loyihalarni amalga oshirish va maqsadlaringizga erishishda sizning ishonchli hamkoringiz bo'lishga intilamiz",
  "Description": "Tavsif"
}